
## Plan Result (terraform/aws/external-secrets-operator)

[CI link](https://github.com/boxp/arch/actions/runs/8223353100)


<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_group.external_secrets_operator_group
  * aws_iam_group_membership.external_secrets_operator_membership
  * aws_iam_group_policy.external_secrets_policy
  * aws_iam_user.external_secrets_operator_user


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_group.external_secrets_operator_group will be created
  + resource "aws_iam_group" "external_secrets_operator_group" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "external-secrets-operator-group"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # aws_iam_group_membership.external_secrets_operator_membership will be created
  + resource "aws_iam_group_membership" "external_secrets_operator_membership" {
      + group = "external-secrets-operator-group"
      + id    = (known after apply)
      + name  = "external-secrets-operator-membership"
      + users = [
          + "exteral-secrets-operator-user",
        ]
    }

  # aws_iam_group_policy.external_secrets_policy will be created
  + resource "aws_iam_group_policy" "external_secrets_policy" {
      + group       = "external-secrets-operator-group"
      + id          = (known after apply)
      + name        = "external-secrets-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "es.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_user.external_secrets_operator_user will be created
  + resource "aws_iam_user" "external_secrets_operator_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "exteral-secrets-operator-user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label terraform/aws/external-secrets-operator/add-or-update: POST https://api.github.com/repos/boxp/arch/issues/23/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":23,"Program":"tfcmt","SHA1":"b277b9cab2d17f30f6734ec53b48fbc4826f4964","Target":"terraform/aws/external-secrets-operator","Vars":{},"WorkflowName":"pull_request_target"} -->